
## Plan Result

[CI link](https://ap-northeast-1.console.aws.amazon.com/codebuild/home?region=ap-northeast-1#/builds/terraform-dryrun:a99e467b-e7cc-4a97-ac06-f62acfd74f8d/view/new)


<pre><code>Plan: 1 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * aws_sns_topic.terraform-test2


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_sns_topic.terraform-test2 will be created
  + resource "aws_sns_topic" "terraform-test2" {
      + arn                         = (known after apply)
      + content_based_deduplication = false
      + fifo_topic                  = false
      + id                          = (known after apply)
      + name                        = "terraform-test2"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + signature_version           = (known after apply)
      + tags                        = {
          + "arn"                         = "arn:aws:s3:::zukkie-terraform-state"
          + "bucket"                      = "zukkie-terraform-state"
          + "bucket_domain_name"          = "zukkie-terraform-state.s3.amazonaws.com"
          + "bucket_regional_domain_name" = "zukkie-terraform-state.s3.ap-northeast-1.amazonaws.com"
          + "hosted_zone_id"              = "Z2M4EHUR26P7ZW"
          + "id"                          = "zukkie-terraform-state"
          + "region"                      = "ap-northeast-1"
        }
      + tags_all                    = {
          + "arn"                         = "arn:aws:s3:::zukkie-terraform-state"
          + "bucket"                      = "zukkie-terraform-state"
          + "bucket_domain_name"          = "zukkie-terraform-state.s3.amazonaws.com"
          + "bucket_regional_domain_name" = "zukkie-terraform-state.s3.ap-northeast-1.amazonaws.com"
          + "hosted_zone_id"              = "Z2M4EHUR26P7ZW"
          + "id"                          = "zukkie-terraform-state"
          + "region"                      = "ap-northeast-1"
        }
      + tracing_config              = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobID":"terraform-dryrun:a99e467b-e7cc-4a97-ac06-f62acfd74f8d","PRNumber":25,"Program":"tfcmt","SHA1":"986c4d12312d405b0a22367315cd057d16ae4523","Vars":{}} -->